docs/spec/html/data-model.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0000005">1. Data Model（SQLite）</a>
<ul>
<li><a href="#org0000000">1.1. 基本方針（案）</a></li>
<li><a href="#org0000001">1.2. エンティティ（案）</a></li>
<li><a href="#org0000002">1.3. MVP v0 スキーマ案（DDL）</a></li>
<li><a href="#org0000003">1.4. 状態（S1/S2）の実装イメージ（MVP）</a></li>
<li><a href="#org0000004">1.5. 未決（このファイルの範囲で残す）</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org0000005" class="outline-2">
<h2 id="org0000005"><span class="section-number-2">1.</span> Data Model（SQLite）</h2>
<div class="outline-text-2" id="text-1">
<p>
本ドキュメントは、SQLite上でS1/S2を含む状態モデルをどう表現するかの具体案を定義する。
現時点では未確定要素が多いため、まずはMVPに必要な最小要件から固める。
</p>
</div>

<div id="outline-container-org0000000" class="outline-3">
<h3 id="org0000000"><span class="section-number-3">1.1.</span> 基本方針（案）</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>S1とS2は「別の保存先」ではなく、同一Contentレコードを `state` で表す（S1→S2は更新）。</li>
<li>同一URLの再取り込みは別Contentとして追加する（decisions.org参照）。</li>
<li>取得/抽出の試行は、Content本体とは分けて「実行ログ（attempt/run）」として保持する（失敗の可観測性と再実行のため）。</li>
<li>抽出した本文テキスト（article_text）はスナップショットとして保存する（decisions.org参照）。</li>
</ul>
</div>
</div>

<div id="outline-container-org0000001" class="outline-3">
<h3 id="org0000001"><span class="section-number-3">1.2.</span> エンティティ（案）</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Content
<ul class="org-ul">
<li>Capture（入力）を1単位として表す</li>
<li>`state`（S1/S2/&#x2026;）を持つ</li>
</ul></li>
<li>FetchRun
<ul class="org-ul">
<li>URL→本文取得の1回の試行</li>
<li>provider（agent-browser等）、成功/失敗、エラー要約、本文ハッシュ等を持つ</li>
</ul></li>
<li>Topic
<ul class="org-ul">
<li>Contentから抽出されたTopic（3〜7目安）</li>
<li>抽出不能の場合は0件になり得る（その場合はS1に留める）</li>
</ul></li>
<li>Shelf / ShelfTopic（またはShelfTopicLink）
<ul class="org-ul">
<li>Topicを束ねた論理集合（S2の匂わせ表示のため）</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org0000002" class="outline-3">
<h3 id="org0000002"><span class="section-number-3">1.3.</span> MVP v0 スキーマ案（DDL）</h3>
<div class="outline-text-3" id="text-1-3">
<p>
目的は「実装の初期形を迷わず作れること」なので、まずは以下の最小DDLを仮置きする。
将来的に、差分保存・正規化・全文検索などに合わせて拡張する。
</p>

<div class="org-src-container">
<pre class="src src-sql">-- SQLite pragmas（例）
PRAGMA foreign_keys = ON;

-- 状態は TEXT として保持し、アプリ側で検証する（MVP）。
-- 例: 'S1' | 'S2' | 'S3' | 'S4' | 'S6' | 'S7'

CREATE TABLE IF NOT EXISTS contents (
  id TEXT PRIMARY KEY,                    -- UUID（アプリ生成）
  url TEXT NOT NULL,
  url_host TEXT,                          -- 例: sqlite.org（小文字）
  canonical_url TEXT,                     -- 未確定: 正規化するならここに格納
  state TEXT NOT NULL,                    -- 'S1' など
  captured_at TEXT NOT NULL,              -- ISO-8601
  updated_at TEXT NOT NULL,               -- ISO-8601

  -- 手動処理の現状把握
  last_fetch_run_id TEXT,                 -- FK（任意）
  last_topic_run_id TEXT,                 -- FK（任意）

  -- 形式破綻/重複など（MVPは boolean 相当でよい）
  -- `is_*` は「最新の判定結果」として扱い、再実行で上書きされる（decisions.org参照）。
  is_full_duplicate INTEGER NOT NULL DEFAULT 0,
  is_context_missing INTEGER NOT NULL DEFAULT 0,
  is_dead_link INTEGER NOT NULL DEFAULT 0,

  -- 失敗追跡（最新の要約）
  last_error TEXT
);

CREATE INDEX IF NOT EXISTS idx_contents_state_captured_at
  ON contents(state, captured_at);

CREATE INDEX IF NOT EXISTS idx_contents_url_captured_at
  ON contents(url, captured_at);

CREATE TABLE IF NOT EXISTS fetch_runs (
  id TEXT PRIMARY KEY,                    -- UUID
  content_id TEXT NOT NULL,
  provider TEXT NOT NULL,                 -- 'agent-browser' 等
  status TEXT NOT NULL,                   -- 'ok' | 'failed'
  started_at TEXT NOT NULL,
  finished_at TEXT,
  error_summary TEXT,

  -- 表示用（一覧/ログ）
  page_title TEXT,

  -- 本文スナップショット（MVP: TEXTで保持）
  article_text TEXT,
  article_sha256 TEXT,                    -- TEXTのハッシュ（任意だが推奨）

  warnings_json TEXT,                     -- JSON文字列（任意）

  FOREIGN KEY(content_id) REFERENCES contents(id) ON DELETE CASCADE
);

CREATE INDEX IF NOT EXISTS idx_fetch_runs_content_started_at
  ON fetch_runs(content_id, started_at);

CREATE TABLE IF NOT EXISTS topic_runs (
  id TEXT PRIMARY KEY,                    -- UUID
  content_id TEXT NOT NULL,
  source_fetch_run_id TEXT,               -- topic生成の入力元（任意）
  status TEXT NOT NULL,                   -- 'ok' | 'skipped' | 'failed'
  started_at TEXT NOT NULL,
  finished_at TEXT,
  error_summary TEXT,

  -- 入力の同一性確認用（任意）
  article_sha256_used TEXT,

  FOREIGN KEY(content_id) REFERENCES contents(id) ON DELETE CASCADE,
  FOREIGN KEY(source_fetch_run_id) REFERENCES fetch_runs(id) ON DELETE SET NULL
);

CREATE INDEX IF NOT EXISTS idx_topic_runs_content_started_at
  ON topic_runs(content_id, started_at);

CREATE TABLE IF NOT EXISTS topics (
  id TEXT PRIMARY KEY,                    -- UUID
  content_id TEXT NOT NULL,
  topic_run_id TEXT NOT NULL,
  ordinal INTEGER NOT NULL,               -- 0..N-1
  text TEXT NOT NULL,

  -- 強シグナル候補（Topic単位、decisions.org参照）
  has_signal_deadline INTEGER NOT NULL DEFAULT 0,
  has_signal_dependency INTEGER NOT NULL DEFAULT 0,
  has_signal_irreversible INTEGER NOT NULL DEFAULT 0,
  has_signal_safety INTEGER NOT NULL DEFAULT 0,

  FOREIGN KEY(content_id) REFERENCES contents(id) ON DELETE CASCADE,
  FOREIGN KEY(topic_run_id) REFERENCES topic_runs(id) ON DELETE CASCADE
);

CREATE UNIQUE INDEX IF NOT EXISTS idx_topics_run_ordinal
  ON topics(topic_run_id, ordinal);

-- 意図ラベルは Topic に付与する（decisions.org参照）
CREATE TABLE IF NOT EXISTS topic_intent_labels (
  topic_id TEXT NOT NULL,
  label TEXT NOT NULL,
  created_at TEXT NOT NULL,

  FOREIGN KEY(topic_id) REFERENCES topics(id) ON DELETE CASCADE,
  PRIMARY KEY(topic_id, label)
);
</pre>
</div>
</div>
</div>

<div id="outline-container-org0000003" class="outline-3">
<h3 id="org0000003"><span class="section-number-3">1.4.</span> 状態（S1/S2）の実装イメージ（MVP）</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>S1:
<ul class="org-ul">
<li>`contents.state = 'S1'`</li>
<li>fetch_runs / topic_runs は 0件でもよい（未処理）</li>
</ul></li>
<li>S2:
<ul class="org-ul">
<li>`contents.state = 'S2'`</li>
<li>少なくとも1回の `topic_runs.status = 'ok'` と、対応する `topics` が存在する</li>
<li>`article_text` は `fetch_runs` に保存され、`contents.last_fetch_run_id` で最新参照できる</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org0000004" class="outline-3">
<h3 id="org0000004"><span class="section-number-3">1.5.</span> 未決（このファイルの範囲で残す）</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>URL正規化（canonical_url）のルール</li>
<li>article_text の圧縮/上限/保持期間</li>
<li>差分保存（Diff）の導入可否と方式</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
